README.md
```mermaid
graph LR
  subgraph Kie To FS
    direction LR
    PT(Polling Trigger) --> CPP(Create Person Payload)
    CPP --> PTM[Payload To Metadata]
    PTM --> KS[Kie Service]
    KS --> AI[Aggregate Info]
    AI --> FSP[FS Producer]
  end
  FSP --> FS[FS]
```
